---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CircuitNumberingOption
source: html/2f1f8c9e-812f-ac3c-bf3e-3bfd748635b5.htm
---
# Autodesk.Revit.DB.Electrical.CircuitNumberingOption

An enumerated type listing all the circuit numbering options.

## Syntax (C#)
```csharp
public enum CircuitNumberingOption
```